public class VisitStatic {
    public static void main(String[] args) {
        //类名.类变量
        //说明类变量是随着类加载而创建，所以没有创建对象实例也可以访问
        System.out.println(A.name);
    }
}
class A{
    //类变量
    //类变量的访问，必须遵守相关的访问权限

    public static String name="罗君维";
    /**
     * 1.什么时候需要使用类变量：但我们需要让某个类的所有对象共享一个变量时，就可以考虑使用类变量（静态变量）
     * 比如：定义学生类，统计所有学生共交多少钱，Student(name,static,fee)
     * 2.类变量和实例变量的区别：类变量时该类的所有对象共享的，而实例变量时每个对象独享的。
     * 3.加上static称类变量或金泰变量，否则称为实例变量-普通变量-非静态变量
     * 4.类变量可以通过类目，类变量名或则对象名，类变量名来访问，，但java设计者推荐我们使用类名，类变量名或则对象名。类变量名来访问，但java设计者
     * 推荐我们使用类名。类变量名的方式访问{前提是满足范文修饰符的权限和范围}
     * 5.实例变量不能通过类名.变量名来访问 {A a = new A() a.name}只能如此访问，不能 A.name
     * 6.类变量是在类加载时就初始化了，即使你没有实例化，也能访问
     * 7.类变量的生命周期是随着类的加载开始，随着类的消亡而销毁
     * */
}
